# vi: ft=ruby

# See also: https://github.com/Homebrew/homebrew-bundle
#
# This runs automatically via an rcm post-up hook

tap "heroku/brew"
tap "oven-sh/bun"

brew "bash" # shell -- generally using zsh, but nice to have a modern version of bash around
brew "bat" # cat but with syntax highlighting
brew "bun" # node.js replacement
brew "cloc" # count lines of code
brew "ctags" # generate tags files
brew "emacs" # text editor that I have always meant to learn but never actually got around to
brew "fd" # find replacement
brew "fnm" # fast node.js manager
brew "gh" # New GitHub CLI, via https://github.com/cli/cli
brew "git" # version control
brew "git-delta" # Displays diffs pretty, exposes delta CLI
brew "git-lfs" # git large file storage
brew "graphviz"
brew "heroku" # Heroku CLI
brew "htop" # CLI alternative to Activity Monitor, upgrade from the built-in top
brew "imagemagick"
brew "jq" # utility for pretty-printing and filtering streams of JSON-formatted text
brew "ncdu" # upgrade over du, helps you figure out where your disk space is going
brew "neovim" # yet another text editor that I have meant to evaluate but haven't gotten to
brew "postgresql@14"
brew "pure" # nice prompt https://www.hardscrabble.net/2021/pure-prompt/
brew "rbenv" # managing ruby versions
brew "rcm"
brew "redis"
brew "ripgrep" # grep replacement, exposes rg CLI
brew "shellcheck" # linter for shell scripts
brew "sl" # steam locomotive https://www.hardscrabble.net/2022/steam-locomotive/
brew "swiftlint"
brew "terminal-notifier" # trigger macOS notifications from shell scripts
brew "tig" # git helper thing I use it to browse stashes on the command line
brew "tmux" # terminal multiplexer
brew "tree" # pretty-prints contents of a directory
brew "vim" # primary text editor
brew "watch" # runs some command over and over
brew "wget" # download files
brew "yarn"
brew "youtube-dl", args: ["HEAD"] # download videos from youtube and other websites
brew "zsh" # preferred shell; need to add it to `/etc/shells` then run `chsh -s /opt/homebrew/bin/zsh`
brew "zsh-syntax-highlighting" # syntax highlights commands as you enter them into zsh shell
